Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/worksheets/index.html.txt.tmx
Source language: en
Languages: ga

source: Worksheet for calculating Rent Supplement
ga: Bileog Oibre le haghaidh Forlíonadh Cíosa a ríomh

source: This is a worksheet to help you calculate Rent Supplement
ga: Is bileog oibre í seo a chabhróidh leat do Fhorlíonadh Cíosa a ríomh

source: This worksheet must be used with our document on 'How to calculate Rent Supplement'
ga: Caithfear an bhileog oibre seo a úsáid lenár ndoiciméad ar Conas Forlíonadh Cíosa a Ríomh

source: Worksheet on calculating your redundancy payment
ga: Bileog Oibre: Íocaíocht do Theaghlach Aon-Tuismitheora agus ioncam ó obair

source: Your redundancy lump sum is calculated according a certain formula based on your years of service in an employment. This worksheet is to help you work it out for yourself
ga: Is é an aidhm atá leis an mbileog oibre seo ná cabhrú leat, má tá tú ag fáil Íocaíocht do Theaghlach Aon-Tuismitheora (OPF), oibriú amach cén tionchar a bhéas ag jab ar d'ioncam seachtainiúil

source: Worksheet: How to calculate your Family Income Supplement
ga: Bileog oibre maidir le d’íocaíocht iomarcaíochta a ríomh

source: This worksheet is to help you to work out the amount to Family Income Supplement you may get in 2017
ga: Tá an bhileog oibre seo ceaptha chun cuidiú leat é a oibriú amach duit féin

source: Worksheet: Jobseeker's Allowance and income from work
ga: Bileog oibre: Liúntas Cuardaitheora Poist agus ioncam ón obair

source: This worksheet can help you find out how part-time work can affect your Jobseeker's Allowance
ga: Tá sé d’aidhm ag an mbileog oibre seo cabhrú leat a fháil amach cén tionchar a bheidh ag obair páirtaimseartha nó ócáideach ar do Liúntas Cuardaitheora Poist seachtainiúil

source: Worksheet: One-Parent Family Payment and income from work
ga: Worksheet: How to calculate your Family Income Supplement

source: This worksheet shows the effect of income from work on your One-Parent Family Payment
ga: This worksheet is to help you to work out the amount to Family Income Supplement you may get in 2017

source: Use this worksheet to find out how your earnings from employment will affect your State Pension (Non-Contributory)
ga: Use this worksheet to find out how your earnings from employment will affect your State Pension (Non-Contributory). Teanga

source: Most Read in "Reference"
ga: Ábhar is mó éilimh i "Reference"

source: At what age can I?
ga: Cén aois is féidir liom?

source: Case study: Calculating your income tax
ga: Cás-staidéar: Do cháin ioncaim a ríomh

source: Checklist when applying for Jobseeker's Allowance
ga: Seicliosta nuair atá iarratas á dhéanamh ar Liúntas Cuardaitheora Poist
